system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs    ("libCardiovascularBoundaryCondition.so");

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

#include        "SolutionInfo";

writeControl    adjustableRunTime;

writeInterval   5000;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no; // yes;

maxCo           5;

maxDeltaT       1e-2;

functions
{
//    massFlow 
//    { 
//        type            massFlowRate; 
//        functionObjectLibs ("libmassFlowRateFunctionObjects.so"); 
//        writeControl    outputTime; 
//        patches	();
//    } 
//    fieldAverage1
//    {
//        type                fieldAverage;
//        libs                ("libfieldFunctionObjects.so");
//     
//        writeControl    	outputTime;
//        timeStart           0.002;
//        timeEnd             0.005;
//     
//        restartOnRestart    false;
//        restartOnOutput     false;
//        periodicRestart     false;
//        restartPeriod       0.003;
//     
//        fields
//        (
//            p
//            {
//                mean            on;
//                prime2Mean      off;
//                base            time;
//            }
//        );           
//	}
}

// ************************************************************************* //
