system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile     "constant/triSurface/surface.fms";

maxCellSize     0.00399;

boundaryCellSize 0.00049875;

keepCellsIntersectingBoundary 1;

checkForGluedMesh 0;

enforceGeometryConstraints 0;

decomposePolyhedraIntoTetsAndPyrs no;

objectRefinements
{
    Cap_LAD_D1_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.148631 0.0585688 1.04162 );
        p1              ( -0.14774 0.0586564 1.04118 );
        refinementThickness 0.000946775;
    }
    Cap_LAD_D4_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.168499 0.0301537 1.05849 );
        p1              ( -0.167842 0.0295581 1.05803 );
        refinementThickness 0.000329047;
    }
    Cap_LAD_LAD3_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.12589 0.044052 1.00009 );
        p1              ( -0.126505 0.0441034 0.999302 );
        refinementThickness 0.00110326;
    }
    Cap_LAD_RI_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.180776 0.0600565 1.03095 );
        p1              ( -0.180482 0.0602758 1.03002 );
        refinementThickness 0.00112503;
    }
    Cap_LCX_LCX1_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.190911 0.0519297 1.02106 );
        p1              ( -0.190124 0.0523051 1.02057 );
        refinementThickness 0.000995156;
    }
    Cap_RCA_AM_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.145022 -0.0184527 1.00695 );
        p1              ( -0.14446 -0.01763 1.007 );
        refinementThickness 0.00097897;
    }
    Cap_RCA_RPDA1_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.154226 0.0349213 0.99995 );
        p1              ( -0.153705 0.0356884 0.999583 );
        refinementThickness 0.000852343;
    }
    Cap_RCA_RPLB2_Cylinder
    {
        cellSize        0.000249375;
        type            line;
        p0              ( -0.184253 0.0274341 0.999756 );
        p1              ( -0.184495 0.0282642 1.00025 );
        refinementThickness 0.000936666;
    }
    joint_0_Box
    {
        cellSize        0.00049875;
        type            box;
        centre          ( 0 0 0 );
        lengthX         0;
        lengthY         0;
        lengthZ         0;
    }
    joint_1_Box
    {
        cellSize        0.00049875;
        type            box;
        centre          ( 0 0 0 );
        lengthX         0;
        lengthY         0;
        lengthZ         0;
    }
    joint_2_Box
    {
        cellSize        0.00049875;
        type            box;
        centre          ( 0 0 0 );
        lengthX         0;
        lengthY         0;
        lengthZ         0;
    }
}

localRefinement
{
    Wall_Aorta
    {
        additionalRefinementLevels 2;
        refinementThickness 0.002;
    }
    Cap_LAD_D1
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_LAD_D4
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_LAD_LAD3
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_LAD_RI
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_LCX_LCX1
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_RCA_AM
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_RCA_RPDA1
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_RCA_RPLB2
    {
        additionalRefinementLevels 2;
        refinementThickness 0.001;
    }
    Cap_Aorta_Inlet
    {
        additionalRefinementLevels 1;
        refinementThickness 0.001;
    }
    Cap_Aorta_Outlet
    {
        additionalRefinementLevels 1;
        refinementThickness 0.001;
    }
}

renameBoundary
{
    newPatchNames
    {
        Wall_Aorta
        {
            newName         Wall_Aorta;
            type            wall;
        }
        Cap_LAD_D1
        {
            newName         Cap_LAD_D1;
            type            patch;
        }
        Cap_LAD_D4
        {
            newName         Cap_LAD_D4;
            type            patch;
        }
        Cap_LAD_LAD3
        {
            newName         Cap_LAD_LAD3;
            type            patch;
        }
        Cap_LAD_RI
        {
            newName         Cap_LAD_RI;
            type            patch;
        }
        Cap_LCX_LCX1
        {
            newName         Cap_LCX_LCX1;
            type            patch;
        }
        Cap_RCA_AM
        {
            newName         Cap_RCA_AM;
            type            patch;
        }
        Cap_RCA_RPDA1
        {
            newName         Cap_RCA_RPDA1;
            type            patch;
        }
        Cap_RCA_RPLB2
        {
            newName         Cap_RCA_RPLB2;
            type            patch;
        }
        Cap_Aorta_Inlet
        {
            newName         Cap_Aorta_Inlet;
            type            patch;
        }
        Cap_Aorta_Outlet
        {
            newName         Cap_Aorta_Outlet;
            type            patch;
        }
    }
}

meshQualitySettings
{
    maxNonOrthogonality 65;
    maxSkewness     2;
}


// ************************************************************************* //
