constant/scaled_pulse_flow.flow
(
(0.000000	 5.257920e-05)
(0.001000	 5.511300e-05)
(0.002000	 5.764682e-05)
(0.003000	 6.018063e-05)
(0.004000	 6.271444e-05)
(0.005000	 6.524824e-05)
(0.006000	 6.778205e-05)
(0.007000	 7.031587e-05)
(0.008000	 7.284968e-05)
(0.009000	 7.538348e-05)
(0.010000	 7.791729e-05)
(0.011000	 8.045110e-05)
(0.012000	 8.298492e-05)
(0.013000	 8.551872e-05)
(0.014000	 8.805253e-05)
(0.015000	 9.058634e-05)
(0.016000	 9.312015e-05)
(0.017000	 9.565396e-05)
(0.018000	 9.818777e-05)
(0.019000	 1.007216e-04)
(0.020000	 1.032554e-04)
(0.021000	 1.057892e-04)
(0.022000	 1.083230e-04)
(0.023000	 1.108568e-04)
(0.024000	 1.133906e-04)
(0.025000	 1.159244e-04)
(0.026000	 1.184583e-04)
(0.027000	 1.209921e-04)
(0.028000	 1.235259e-04)
(0.029000	 1.260597e-04)
(0.030000	 1.285935e-04)
(0.031000	 1.311273e-04)
(0.032000	 1.336611e-04)
(0.033000	 1.361949e-04)
(0.034000	 1.387287e-04)
(0.035000	 1.412625e-04)
(0.036000	 1.437963e-04)
(0.037000	 1.463302e-04)
(0.038000	 1.488640e-04)
(0.039000	 1.513978e-04)
(0.040000	 1.539316e-04)
(0.041000	 1.565291e-04)
(0.042000	 1.591267e-04)
(0.043000	 1.617242e-04)
(0.044000	 1.643218e-04)
(0.045000	 1.669193e-04)
(0.046000	 1.695169e-04)
(0.047000	 1.721144e-04)
(0.048000	 1.747120e-04)
(0.049000	 1.773095e-04)
(0.050000	 1.799071e-04)
(0.051000	 1.825046e-04)
(0.052000	 1.851022e-04)
(0.053000	 1.876997e-04)
(0.054000	 1.902973e-04)
(0.055000	 1.928948e-04)
(0.056000	 1.954924e-04)
(0.057000	 1.980899e-04)
(0.058000	 2.006875e-04)
(0.059000	 2.032850e-04)
(0.060000	 2.058826e-04)
(0.061000	 2.084801e-04)
(0.062000	 2.110777e-04)
(0.063000	 2.136752e-04)
(0.064000	 2.162728e-04)
(0.065000	 2.188703e-04)
(0.066000	 2.214679e-04)
(0.067000	 2.240654e-04)
(0.068000	 2.266630e-04)
(0.069000	 2.292605e-04)
(0.070000	 2.318580e-04)
(0.071000	 2.344556e-04)
(0.072000	 2.370532e-04)
(0.073000	 2.396507e-04)
(0.074000	 2.422482e-04)
(0.075000	 2.448458e-04)
(0.076000	 2.474433e-04)
(0.077000	 2.500409e-04)
(0.078000	 2.526384e-04)
(0.079000	 2.552360e-04)
(0.080000	 2.578335e-04)
(0.081000	 2.592359e-04)
(0.082000	 2.606383e-04)
(0.083000	 2.620407e-04)
(0.084000	 2.634431e-04)
(0.085000	 2.648456e-04)
(0.086000	 2.662480e-04)
(0.087000	 2.676504e-04)
(0.088000	 2.690528e-04)
(0.089000	 2.704552e-04)
(0.090000	 2.718576e-04)
(0.091000	 2.732600e-04)
(0.092000	 2.746624e-04)
(0.093000	 2.760648e-04)
(0.094000	 2.774672e-04)
(0.095000	 2.788696e-04)
(0.096000	 2.802720e-04)
(0.097000	 2.816744e-04)
(0.098000	 2.830768e-04)
...
)
