0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Wall_Aorta
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_LAD_D1
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_LAD_D4
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_LAD_LAD3
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_LAD_RI
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_LCX_LCX1
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_RCA_AM
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_RCA_RPDA1
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_RCA_RPLB2
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_Aorta_Inlet
    {
        type            calculated;
        value           uniform 0;
    }
    Cap_Aorta_Outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
