0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    Wall_Aorta
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_LAD_D1
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_LAD_D4
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_LAD_LAD3
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_LAD_RI
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_LCX_LCX1
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_RCA_AM
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_RCA_RPDA1
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_RCA_RPLB2
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Cap_Aorta_Inlet
    {
        type            contrastFvPatchScalarField;
        value           uniform 0;
        Cmin            3.63632e-321;
        Cmax            1.23516e-322;
        ts              6.9267e-310;
        Td              6.9267e-310;
    }
    Cap_Aorta_Outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
