0/UShoot
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UShoot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    Wall_Aorta
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    Cap_LAD_D1
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 1.11503e-07;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_LAD_D4
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 7.3694e-09;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_LAD_LAD3
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 1.70506e-07;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_LAD_RI
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 1.76209e-07;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_LCX_LCX1
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 1.21226e-07;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_RCA_AM
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 1.16267e-07;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_RCA_RPDA1
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 8.39017e-08;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_RCA_RPLB2
    {
        type            updateFlowRateOutletVelocityMixture;
        value           uniform ( 0 0 0 );
        volumetricFlowRate 1.12809e-07;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 1;
    }
    Cap_Aorta_Inlet
    {
        type            cardiovascularFlowRateInletVelocity;
        value           uniform ( 0 0 0 );
        flowRateModel   rawDataFlowRate;
        rawDataFlowRateCoeffs
        {
            outOfBounds     repeat;
            file            "constant/scaled_pulse_flow.flow";
            scaling         constant 0.353649;
        }
    }
    Cap_Aorta_Outlet
    {
        type            inletOutlet;
        value           uniform ( 0 0 0 );
        inletValue      uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
