system/GeometryFiles
"constant/surfaces/Cap_Aorta_Inlet.stl"
"constant/surfaces/Cap_Aorta_Outlet.stl"
"constant/surfaces/Cap_LAD_D1.stl"
"constant/surfaces/Cap_LAD_D4.stl"
"constant/surfaces/Cap_LAD_LAD3.stl"
"constant/surfaces/Cap_LAD_RI.stl"
"constant/surfaces/Cap_LCX_LCX1.stl"
"constant/surfaces/Cap_RCA_AM.stl"
"constant/surfaces/Cap_RCA_RPDA1.stl"
"constant/surfaces/Cap_RCA_RPLB2.stl"
"constant/surfaces/Wall_Aorta.stl"
