system/ProbeLocation
probeLocations (
(0.0521023 -0.0594026 -0.0487398)
);
probeVessels (
Cap_RCA_LAD
);
FFR (
0.78
);
