system/SolutionInfo
p 0.000600;
 pRest 0.000600;
 pHyper 0.000600;
 pShoot 0.000600;
 deltaT 1;
