system/casePreparerQFRDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      casePreparerDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * * * * Mesh * * * * * * * * * * * * * * * * * * * //

//debug       off;

mesh
{
  
    //- cfMeshMode
    #include "MeshingInfo";
    combinedSurfaceFileName "surface.stl";

    boundaryFiles               
    (
        #include "GeometryFiles"
    );

    scalingFactor                 1e-3;
    backgroundBox
    {
        dx          4.0e-3;
        dy          4.0e-3;
        dz          4.0e-3;
        expandRatio 0.1;
    }                 
}

// * * * * * * * * * * * * * * * * Fields * * * * * * * * * * * * * * * * * * * //
fields
{
    changeDictionaryTemplate    "system/changeDictionaryDictTemplate";                  
}

                                                                                                                         
                                                                                                                           